def evklid(a, b):  # Функція знаходження найбільшого спільного дільника
    if b == 0:
        return a
    else:
        return evklid(b, a % b)


# Введення чисел з перевіркою на коректність
while True:
    try:
        a = int(input("Введіть перше число (a): "))
        b = int(input("Введіть друге число (b): "))
        if a == 0 or b == 0:
            print("Числа не повинні бути нулями. Спробуйте ще раз.")
        else:
            break
    except ValueError:
        print("Будь ласка, введіть ціле число!")

# Виклик функції та виведення результату
print(f"Найбільший спільний дільник чисел {a} і {b} дорівнює {evklid(a, b)}.")
